#include <iostream>
#include "String.h"
using std::cout;
using std::endl;

//***************************************************
//Визначити і реалізувати власний клас рядків String:
//конструктор за С-рядком, STL-рядком, копіювальні 
//і пересувні конструктор і присвоєння, суміщене 
//присвоєння, оператори [], +, ==,!=. Забезпечити 
//можливість виконання змішаних операцій над 
//власними рядками, С-рядками і STL-рядками.
//Developed by Ruslan Zymovets (IPZ, group 1)
//on March 15
//Version 1.0
//***************************************************

int main(void)
{
	String s("1231");
	String s2 = "1234124";
	std::string stt = "231";

	cout << (s = stt) << endl;
	return 0;
}